<?php
/**
 * 
 * Duhok Forum 3.0
 * @author		Dilovan Matini (original founder)
 * @copyright	2007 - 2021 Dilovan Matini
 * @see			df.lelav.com
 * @see			https://github.com/dilovanmatini/duhok-forum
 * @license		http://www.gnu.org/copyleft/lesser.html GNU Lesser General Public License
 * @note		This program is distributed in the hope that it will be useful - WITHOUT ANY WARRANTY;
 * 
 */
$arCount=array(
"ET"=>"إثيوبيا",
"AZ"=>"إذربيجان",
"AM"=>"أرمينيا",
"AW"=>"أروبا",
"ER"=>"إريتريا",
"UZ"=>"أزبكستان",
"ES"=>"أسبانيا",
"AU"=>"أستراليا",
"EE"=>"إستونيا",
"SS"=>"إسكوتلندا",
"AF"=>"أفغانستان",
"AL"=>"ألبانيا",
"DE"=>"ألمانيا",
"DD"=>"ألمانيا الشرقية",
"AG"=>"أنتيجا وبربودا",
"EN"=>"إنجلترا",
"AI"=>"أنجيلا",
"AD"=>"أندورا",
"ID"=>"إندونيسيا",
"AO"=>"أنغولا",
"UY"=>"أوروجواي",
"UG"=>"أوغندا",
"UA"=>"أوكرانيا",
"IR"=>"إيران",
"IE"=>"إيرلندا",
"ND"=>"إيرلندا الشمالية",
"IS"=>"أيسلندا",
"IT"=>"إيطاليا",
"ZS"=>"الإتحاد السوفيتي",
"AR"=>"الأرجنتين",
"JO"=>"الأردن",
"EC"=>"الإكوادور",
"AE"=>"الإمارات",
"BH"=>"البحرين",
"BR"=>"البرازيل",
"PT"=>"البرتغال",
"BS"=>"البهاما",
"BA"=>"البوسنة والهرسك",
"CZ"=>"التشيك",
"GA"=>"الجابون",
"DZ"=>"الجزائر",
"DK"=>"الدانمارك",
"DO"=>"الدومينيكان",
"AS"=>"الساموا الأمريكية",
"SA"=>"السعودية",
"SV"=>"السلفادور",
"SN"=>"السنغال",
"SD"=>"السودان",
"SE"=>"السويد",
"SC"=>"السيشيل",
"SO"=>"الصومال",
"CN"=>"الصين",
"IQ"=>"العراق",
"PH"=>"الفلبين",
"CM"=>"الكاميرون",
"CG"=>"الكونجو",
"KW"=>"الكويت",
"HU"=>"المجر",
"MA"=>"المغرب",
"MX"=>"المكسيك",
"MU"=>"الموريشيس",
"NO"=>"النرويج",
"AT"=>"النمسا",
"NP"=>"النيبال",
"NE"=>"النيجر",
"IN"=>"الهند",
"HN"=>"الهوندوراس",
"US"=>"الولايات المتحدة الأمريكية",
"JP"=>"اليابان",
"YE"=>"اليمن",
"GR"=>"اليونان",
"AQ"=>"انتاركتيكا",
"PG"=>"بابوا نيو جيني",
"PY"=>"باراجواي",
"PK"=>"باكستان",
"PW"=>"بالاو",
"BB"=>"بربادوس",
"BM"=>"برمودا",
"BN"=>"بروناي دار السلام",
"GB"=>"بريطانيا",
"BE"=>"بلجيكا",
"BG"=>"بلغاريا",
"BZ"=>"بليز",
"BD"=>"بنغلادش",
"PA"=>"بنما",
"BJ"=>"بنين",
"BT"=>"بوتان",
"BW"=>"بوتسوانا",
"PR"=>"بورتو ريكو",
"BF"=>"بوركينا فاسو",
"BI"=>"بوروندي",
"PL"=>"بولندا",
"BO"=>"بوليفيا",
"PF"=>"بولينيسيا الفرنسية",
"PE"=>"بيرو",
"TJ"=>"تاطجكستان",
"TH"=>"تايلاند",
"TW"=>"تايوان",
"TM"=>"تركمنستان",
"TR"=>"تركيا",
"TT"=>"ترينيداد وتوباجو",
"TD"=>"تشاد",
"CE"=>"تشيكوسلوفاكيا",
"CL"=>"تشيلي",
"TZ"=>"تنزانيا",
"TG"=>"توجو",
"TV"=>"توفالو",
"TO"=>"تونجا",
"TN"=>"تونس",
"TP"=>"تيمور الشرقية",
"GM"=>"جامبيا",
"JM"=>"جاميكا",
"GI"=>"جبل طارق",
"GD"=>"جرنادا",
"AN"=>"جزر الأنتيل",
"RE"=>"جزر الرينيون",
"SB"=>"جزر السولومون",
"FK"=>"جزر الفلكلاند",
"KM"=>"جزر القمر",
"KY"=>"جزر الكايمان",
"CC"=>"جزر الكوكوس",
"MH"=>"جزر المارشال",
"MV"=>"جزر المالديف",
"GL"=>"جزر جرينلاند",
"FO"=>"جزر فاروه",
"FJ"=>"جزر فيجي",
"CK"=>"جزر كوك",
"BV"=>"جزيرة بوفيه",
"CF"=>"جمهورية أفريقيا الوسطى",
"CD"=>"جمهورية الكونجو",
"ZA"=>"جنوب أفريقيا",
"GT"=>"جواتيمالا",
"GP"=>"جوادلوب",
"GU"=>"جوام",
"GE"=>"جورجيا",
"DJ"=>"جيبوتي",
"GW"=>"جينيا بيساو",
"DM"=>"دومينيكا",
"RW"=>"رواندا",
"RU"=>"روسيا",
"BY"=>"روسيا البيضاء",
"RO"=>"رومانيا",
"ZM"=>"زامبيا",
"ZW"=>"زمبابوي",
"CI"=>"ساحل العاج",
"WS"=>"ساموا",
"SM"=>"سان مارينو",
"LC"=>"سانت لوسيا",
"LK"=>"سري لانكا",
"SK"=>"سلوفاكيا",
"SI"=>"سلوفينيا",
"SG"=>"سنغافورة",
"SZ"=>"سوازيلاند",
"SY"=>"سوريا",
"SR"=>"سورينام",
"CH"=>"سويسرا",
"SL"=>"سييرا ليون",
"SX"=>"صربيا",
"OM"=>"عمان",
"GH"=>"غانا",
"GY"=>"غيانا",
"GF"=>"غيانا الفرنسية",
"GN"=>"غينيا",
"GQ"=>"غينيا الإستوائية",
"VU"=>"فاناتو",
"FR"=>"فرنسا",
"PS"=>"فلسطين",
"VE"=>"فنزويلا",
"FI"=>"فنلندا",
"VN"=>"فيتنام",
"CY"=>"قبرص",
"QA"=>"قطر",
"CV"=>"كاب فيردي",
"KZ"=>"كازاخستان",
"NC"=>"كاليدونيا الجديدة",
"HR"=>"كرواتيا",
"KH"=>"كمبوديا",
"CA"=>"كندا",
"CU"=>"كوبا",
"KR"=>"كوريا الجنوبية",
"KP"=>"كوريا الشمالية",
"CR"=>"كوستا ريكا",
"CO"=>"كولمبيا",
"KG"=>"كيرجيستان",
"KI"=>"كيريباتي",
"KE"=>"كينيا",
"LV"=>"لاتفيا",
"LA"=>"لاوس",
"LB"=>"لبنان",
"LU"=>"لوكسمبرج",
"LY"=>"ليبيا",
"LR"=>"ليبيريا",
"LT"=>"ليثوانيا",
"LS"=>"ليسوثو",
"LI"=>"ليشتنشتين",
"MQ"=>"مارتينيك",
"MO"=>"ماكاو",
"MW"=>"مالاوي",
"MT"=>"مالطة",
"ML"=>"مالي",
"MY"=>"ماليزيا",
"FM"=>"مايكرونيسيا",
"MG"=>"مدغشقر",
"EG"=>"مصر",
"MK"=>"مقدونيا",
"MR"=>"موريتانيا",
"MZ"=>"موزمبيق",
"MD"=>"مولدوفا",
"MC"=>"موناكو",
"MS"=>"مونسرات",
"MN"=>"مونغوليا",
"MM"=>"ميانمار",
"NA"=>"ناميبيا",
"NR"=>"ناورو",
"NU"=>"نوي",
"NG"=>"نيجيريا",
"NI"=>"نيكاراجوا",
"NZ"=>"نيو زيلندا",
"HT"=>"هايتي",
"NL"=>"هولندا",
"HK"=>"هونج كونج",
"WA"=>"ويلز",
"YU"=>"يوغوسلافيا",

"IL"=>"إسرائيل",
"A1"=>"مجهول المصدر",
"A2"=>"ستلايت",
"AP"=>"منطقة آسيا والمحيط الهادئ",
"AX"=>"جزر أولان",
"EU"=>"أوروبا",
"GG"=>"غويرنسي",
"IM"=>"جزيرة مان",
"IO"=>"المحيط الهندي البريطاني",
"JE"=>"جيرسي",
"KN"=>"سانت كيتس ونيفيس",
"LH"=>"سيرفر محلي",
"ME"=>"الجبل الأسود",
"MP"=>"جزر ماريانا الشمالية",
"NF"=>"جزيرة نورفولك",
"PM"=>"سانت بيير وميكولون",
"RS"=>"صربيا",
"ST"=>"سان تومي وبرينسيبي",
"TC"=>"جزر تركس وكايكوس",
"TK"=>"توكلو",
"UM"=>"جزر الولايات المتحدة",
"VA"=>"الفاتيكان",
"VC"=>"سانت فنسنت وجزر غرينادين",
"VG"=>"جزر فيرجن",
"VI"=>"جزر فيرجن",
"WF"=>"جزر واليس وفوتونا",
"YT"=>"مايوت"
);


//GG


$codes=array(
"A1","A2","AD","AE","AF","AG","AI","AL","AM","AN",
"AO","AP","AQ","AR","AS","AT","AU","AW","AX","AZ",
"BA","BB","BD","BE","BF","BG","BH","BI","BJ","BM",
"BN","BO","BR","BS","BT","BV","BW","BY","BZ","CA",
"CD","CF","CG","CH","CI","CK","CL","CM","CN","CO",
"CR","CU","CV","CY","CZ","DE","DJ","DK","DM","DO",
"DZ","EC","EE","EG","ER","ES","ET","EU","FI","FJ",
"FK","FM","FO","FR","GA","GB","GD","GE","GF","GG",
"GH","GI","GL","GM","GN","GP","GQ","GR","GT","GU",
"GW","GY","HK","HN","HR","HT","HU","ID","IE","IL",
"IM","IN","IO","IQ","IR","IS","IT","JE","JM","JO",
"JP","KE","KG","KH","KI","KM","KN","KP","KR","KW",
"KY","KZ","LA","LB","LC","LH","LI","LK","LR","LS",
"LT","LU","LV","LY","MA","MC","MD","ME","MG","MH",
"MK","ML","MM","MN","MO","MP","MQ","MR","MS","MT",
"MU","MV","MW","MX","MY","MZ","NA","NC","NE","NF",
"NG","NI","NL","NO","NP","NR","NU","NZ","OM","PA",
"PE","PF","PG","PH","PK","PL","PM","PR","PS","PT",
"PW","PY","QA","RE","RO","RS","RU","RW","SA","SB",
"SC","SD","SE","SG","SI","SK","SL","SM","SN","SO",
"SR","ST","SV","SY","SZ","TC","TD","TG","TH","TJ",
"TK","TM","TN","TO","TR","TT","TV","TW","TZ","UA",
"UG","UM","US","UY","UZ","VA","VC","VE","VG","VI",
"VN","VU","WF","WS","YE","YT","ZA","ZM","ZW");

/* $y=0;
for($x=0;$x<count($codes);$x++){
	$code=strtolower($codes[$x]);
	echo'<img src="flags/'.$code.'.png" alt="'.$codes[$x].'" border="0">';
	$y++;
	if($y == 10){
		echo'<br>';
		$y=0;
	}
} */

/* $ip2cHost="localhost";
$ip2cUser="root";
$ip2cPass="0000";
$ip2cDB="ip2country";
$connect=@mysql_connect($ip2cHost,$ip2cUser,$ip2cPass) or die ('error in connect server');
@mysql_select_db($ip2cDB,$connect) or die ('error in select database');

$sql=mysql_query("SELECT DISTINCT(code) FROM ip ORDER BY code ASC") or die (__line__);
while($rs=mysql_fetch_array($sql)){
	$code=$rs['code'];
	if(!isset($arCount[$code])){
		$sql2=mysql_query("SELECT name FROM ip WHERE code = '$code'") or die (__line__);
		$rs2=mysql_fetch_array($sql2);
		$name=$rs2['name'];
	}
	else{
		$name=$arCount[$code];
	}
	mysql_query("insert into _as_ip2count (code,name) values ('$code','$name')") or die (mysql_error());
	//echo '$country[\''.$code.'\']="'.$name.'";<br>';
	//$into.="('$code','$name'),";
} */














?>